Chapter 37/Lecture/DiffGrating-Polar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-20 Thu 17:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Diffraction Grating, Polarization</title>
<meta name="author" content="Jake Kratt" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Diffraction Grating, Polarization</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5ab413b">1. Interference Patterns</a></li>
<li><a href="#org4f38a97">2. Diffraction Grating</a>
<ul>
<li><a href="#org3f61714">2.1. Bright Fringes</a></li>
<li><a href="#org6efdae8">2.2. Application: Spectral Analysis</a></li>
<li><a href="#org70a4eab">2.3. Conceptual Problem 1</a></li>
<li><a href="#orgc9fa207">2.4. Practice Problem 1</a>
<ul>
<li><a href="#org8b7556d">2.4.1. A) What is the spacing (in µm) between adjacent grooves in the grating?</a></li>
<li><a href="#org4f2d070">2.4.2. B) How many grooves?</a></li>
</ul>
</li>
<li><a href="#org14cb1fc">2.5. Practice Problem 2</a>
<ul>
<li><a href="#orgad2612b">2.5.1. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb96bf33">3. Polarization</a>
<ul>
<li><a href="#org0e8a486">3.1. Malus&rsquo;s law</a></li>
<li><a href="#org572d74e">3.2. Practice Problem 3</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5ab413b" class="outline-2">
<h2 id="org5ab413b"><span class="section-number-2">1.</span> Interference Patterns</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Central maximum doesn&rsquo;t change regardless of the amount of slits</li>
<li>More slits = more brighter and more destructive interference
<ul class="org-ul">
<li>Explainable with conservation of energy
<ul class="org-ul">
<li>Same amount of energy still has to go through the slits, so more openings means that each of those points are going to be smaller, but more intense</li>
</ul></li>
</ul></li>
<li>Angular position stays the same</li>
<li>More focused with more slits</li>
</ul>
</div>
</div>
<div id="outline-container-org4f38a97" class="outline-2">
<h2 id="org4f38a97"><span class="section-number-2">2.</span> Diffraction Grating</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>DVDs</li>
<li>Parallel grooves means interference patterns</li>
</ul>
</div>
<div id="outline-container-org3f61714" class="outline-3">
<h3 id="org3f61714"><span class="section-number-3">2.1.</span> Bright Fringes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
\[ d\sin{\theta} = m\lambda \]
</p>

<p>
\[ m = 0,\pm 1, \pm 2, \pm 3,... \]
</p>


<p>
\[ y = L\frac{m\lambda}{d} \]     (15º or less)
</p>

<ul class="org-ul">
<li>No equations for dark fringes?</li>
<li>No reliabe way to predict dark fringes.</li>
<li>Bear in mind what to use where
<ul class="org-ul">
<li>Single slit: destructive</li>
<li>Double-slit: constructive and destructive</li>
<li>Diffraction: constructive</li>
</ul></li>
<li>Assume everything is uniform</li>
</ul>
</div>
</div>
<div id="outline-container-org6efdae8" class="outline-3">
<h3 id="org6efdae8"><span class="section-number-3">2.2.</span> Application: Spectral Analysis</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Setup: Diffraction grating as the slits the light goes through, and a screen that it hits</li>
<li>By sending light through diffraction grating, you can split apart the waves in a stream of light</li>
<li>Can observe the light waves within half a nanometer of accuracy!</li>
</ul>
</div>
</div>
<div id="outline-container-org70a4eab" class="outline-3">
<h3 id="org70a4eab"><span class="section-number-3">2.3.</span> Conceptual Problem 1</h3>
<div class="outline-text-3" id="text-2-3">
<p>
A diffraction grating produces an interference pattern
</p>

<ol class="org-ol">
<li>Fringes stay in the same spot</li>
</ol>
</div>
</div>
<div id="outline-container-orgc9fa207" class="outline-3">
<h3 id="orgc9fa207"><span class="section-number-3">2.4.</span> Practice Problem 1</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Light from a helium-neon laser, \(\lambda = 633\text{ nm}\), passes through a diffraction grating. A first-order maximum occurs at 19.3º.
</p>
</div>
<div id="outline-container-org8b7556d" class="outline-4">
<h4 id="org8b7556d"><span class="section-number-4">2.4.1.</span> A) What is the spacing (in µm) between adjacent grooves in the grating?</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>\(\lambda = 633\text{ nm}\)</li>
<li>\(\theta = 19.3\text{\textdegree}\)</li>
<li><p>
Need \(d\)
</p>

<p>
\[ d\sin{\theta} = m\lambda \]
</p>

<p>
\[d = \frac{m\lambda}{\sin{\theta}} = 1.92 \mu \text{m}\]
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org4f2d070" class="outline-4">
<h4 id="org4f2d070"><span class="section-number-4">2.4.2.</span> B) How many grooves?</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
\[ d = \frac{1.92\text{ }\mu\text{m}}{\text{groove}} \]
</p>

<p>
\[ \frac{1}{d} = \frac{0.522 \text{ grooves}}{\mu \text{m}} = 522 \frac{\text{grooves}}{\text{mm}} \]
</p>
</div>
</div>
</div>
<div id="outline-container-org14cb1fc" class="outline-3">
<h3 id="org14cb1fc"><span class="section-number-3">2.5.</span> Practice Problem 2</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Light from a sodium lamp passes through a diffraction grating having 1000 slits/mm. The interference pattern is viewed on a screen 1.000 m behind the grating.
</p>

<p>
Two bright yellow fringes are visible 72.88 cm and 73.00 cm from the central max. What are the wavelengths of these fringes?
</p>
</div>
<div id="outline-container-orgad2612b" class="outline-4">
<h4 id="orgad2612b"><span class="section-number-4">2.5.1.</span> Solution</h4>
<div class="outline-text-4" id="text-2-5-1">
<ul class="org-ul">
<li><p>
We have the equations
</p>

<p>
\[ y = \frac{m\lambda}{d} \] or \[ d\sin{\theta} = m\lambda \]
</p>

<p>
\[ d = \frac{1 \text{ mm}}{1000 \text{ slits}} \]
</p>

<p>
\[ d = 1.00\times 10^{-6} \text{ m}\]
</p></li>

<li><p>
Also SOH CAH TOA to find angle
</p>

<p>
\[ \tan{\theta} = \frac{\text{opp}}{\text{adj}} \implies \theta = \tan^{-1}{\left(\frac{\text{opp}}{\text{adj}}\right)} \]
</p>

<p>
\[ \theta_{1} = 36.13\text{\textdegree} \]
</p>

<p>
\[ \theta_{2} = 36.08\text{\textdegree} \]
</p>

<p>
\[ d\sin{\theta} = m\lambda \implies \lambda = \frac{d\sin{\theta}}{m} \]
</p>

<p>
\[ \lambda_{1} = 589.0 \text{ nm} \]
</p>

<p>
\[ \lambda_{2} = 588.6 \text{ nm} \]
</p></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb96bf33" class="outline-2">
<h2 id="orgb96bf33"><span class="section-number-2">3.</span> Polarization</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>A method for changing the intensity of light waves</li>

<li>Examples:
<ul class="org-ul">
<li>Sunglasses
<ul class="org-ul">
<li>Limits what light can pass through
<ul class="org-ul">
<li>Only light that is aligned</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org0e8a486" class="outline-3">
<h3 id="org0e8a486"><span class="section-number-3">3.1.</span> Malus&rsquo;s law</h3>
<div class="outline-text-3" id="text-3-1">
<p>
\[ I = I_{{\text{max}}} \cos^{2}{\theta} \]
</p>

<p>
How the intensity is going to change based on
</p>
<ul class="org-ul">
<li>the max intensity and</li>
<li>the relative angle between the two polaroids</li>
</ul>
</div>
</div>
<div id="outline-container-org572d74e" class="outline-3">
<h3 id="org572d74e"><span class="section-number-3">3.2.</span> Practice Problem 3</h3>
<div class="outline-text-3" id="text-3-2">
<p>
A pair of polarized sunglasses are oriented so that the angle between the polarizing axes of two of the lenses is 30.0º. Unpolarized light from the Sun (at Earth&rsquo;s surface) is directed at the sunglasses with an average intensity of 750 \(W/m^2\)
</p>

<p>
Calculate the intensity of light after it passes through the first lens.
</p>

<p>
\[ I = I_{\text{max}}\cos^{2}{\theta} \]
</p>

<p>
\[ I_{2} = I_{1}\cos^{2}{30.0} \]
</p>

<p>
\[ I_{2} = 281 \frac{W}{m^{2}} \]
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jake Kratt</p>
<p class="date">Created: 2025-02-20 Thu 17:02</p>
</div>
</body>
</html>
